### Agenda: 


* Pandas Index

* Pandas index are the ``Row label`` in the dataframe

* Three (3) uses of indexes

    - identification
    
    - selection
    
    - alignment

---

In [1]:
# Import Libraries

import os
import pandas as pd

%matplotlib inline
import matplotlib.pyplot as plt

In [2]:
# Declare the file path

filepath = os.path.join('Resources', 'ufo.csv')

In [3]:
# Read the csv file into a dataframe using read_csv function

df = pd.read_csv(filepath)
df.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

---

#### Set_index

In [4]:
#Set the index to city

df.set_index('City', inplace=True)

In [5]:
# check the dataframe

df.head()

                     Colors Reported Shape Reported State             Time
City
Ithaca                           NaN       TRIANGLE    NY   6/1/1930 22:00
Willingboro                      NaN          OTHER    NJ  6/30/1930 20:00
Holyoke                          NaN           OVAL    CO  2/15/1931 14:00
Abilene                          NaN           DISK    KS   6/1/1931 13:00
New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [6]:
#Set index name to None

df.index.name = None

In [7]:
# check the dataframe again

df.head()

                     Colors Reported Shape Reported State             Time
Ithaca                           NaN       TRIANGLE    NY   6/1/1930 22:00
Willingboro                      NaN          OTHER    NJ  6/30/1930 20:00
Holyoke                          NaN           OVAL    CO  2/15/1931 14:00
Abilene                          NaN           DISK    KS   6/1/1931 13:00
New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

---

#### Reset Index

In [8]:
data = df.copy()

In [9]:
# Set the index to City

data.index.name = 'City'

In [10]:
# Then, reset back the index to create the numeric row labels

data.reset_index(inplace=True)

In [11]:
data.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

> Another way

In [12]:
df.head()

                     Colors Reported Shape Reported State             Time
Ithaca                           NaN       TRIANGLE    NY   6/1/1930 22:00
Willingboro                      NaN          OTHER    NJ  6/30/1930 20:00
Holyoke                          NaN           OVAL    CO  2/15/1931 14:00
Abilene                          NaN           DISK    KS   6/1/1931 13:00
New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [13]:
# Reset the index
df.reset_index(inplace=True)
df.head()

                  index Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [14]:
# Rename the column index to City

df.rename(columns={'index':'City'}, inplace=True)

In [15]:
# Display data

df.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [16]:
# Describe dataframe

df.describe()

           City Colors Reported Shape Reported  State              Time
count     18216            2882          15597  18241             18241
unique     6476              27             27     52             16145
top     Seattle             RED          LIGHT     CA  11/16/1999 19:00
freq        187             780           2803   2529                27

In [17]:
df.describe().index

Index(['count', 'unique', 'top', 'freq'], dtype='object')

In [19]:
df.describe().columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

---

#### Using Location, can get the desired information

In [20]:
#Get the State with the top number of Reports

df.describe().loc['top', 'State']

'CA'